9/data/attachments/9f25f571eabed047.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_7dee3b1c-3d37-4833-a528-95acda82439a</nif:username>
            <nif:friendToBeAdded>Jeffrey_example_Friend_10282_2</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>